remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam/boards/sam3u_ek/sam3u_ek.h
/**
 * \file
 *
 * \brief SAM3U-EK Board Definition.
 *
 * Copyright (c) 2011-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */
/*
 * Support and FAQ: visit <a href="https://www.microchip.com/support/">Microchip Support</a>
 */

#ifndef _SAM3U_EK_H_
#define _SAM3U_EK_H_

#include "compiler.h"
#include "system_sam3u.h"
#include "exceptions.h"

/*----------------------------------------------------------------------------*/
/**
 *  \page sam3u_ek_opfreq SAM3U-EK - Operating frequencies
 *  This page lists several definition related to the board operating frequency
 *
 *  \section Definitions
 *  - \ref BOARD_FREQ_*
 *  - \ref BOARD_MCK
 */

/** Board oscillator settings */
#define BOARD_FREQ_SLCK_XTAL        (32768U)
#define BOARD_FREQ_SLCK_BYPASS      (32768U)
#define BOARD_FREQ_MAINCK_XTAL      (12000000U)
#define BOARD_FREQ_MAINCK_BYPASS    (12000000U)

/** Master clock frequency */
#define BOARD_MCK                   CHIP_FREQ_CPU_MAX

/** board main clock xtal startup time */
#define BOARD_OSC_STARTUP_US   15625

/*----------------------------------------------------------------------------*/
/**
 * \page sam3u_ek_board_info SAM3U-EK - Board informations
 * This page lists several definition related to the board description.
 *
 * \section Definitions
 * - \ref BOARD_NAME
 * - \ref sam3uek
 * - \ref sam3u
 * - \ref cortexm3
 */

/** Name of the board */
#define BOARD_NAME "SAM3U-EK"
/** Board definition */
#define sam3uek
/** Family definition (already defined) */
#define sam3u
/** Core definition */
#define cortexm3

/*----------------------------------------------------------------------------*/
//! Pins ADC
#define PINS_ADC12B_TRIG  PIO_PA2_IDX
#define PINS_ADC12B_TRIG_FLAG  (PIO_PERIPH_B | PIO_DEFAULT)
#define PINS_ADC_TRIG  PIO_PA17_IDX
#define PINS_ADC_TRIG_FLAG  (PIO_PERIPH_B | PIO_DEFAULT)

//! UART pins (UTXD0 and URXD0) definitions, PA9,10.
#define PINS_UART       (PIO_PA11A_URXD | PIO_PA12A_UTXD)
#define PINS_UART_FLAGS (PIO_PERIPH_A | PIO_DEFAULT)

#define PINS_UART_MASK PIO_PA11A_URXD|PIO_PA12A_UTXD
#define PINS_UART_PIO PIOA
#define PINS_UART_ID ID_PIOA
#define PINS_UART_TYPE PIO_PERIPH_A
#define PINS_UART_ATTR PIO_DEFAULT

/** EBI Data Bus pins */
#define PIN_EBI_DATA_BUS_D0        PIO_PB9_IDX
#define PIN_EBI_DATA_BUS_D1        PIO_PB10_IDX
#define PIN_EBI_DATA_BUS_D2        PIO_PB11_IDX
#define PIN_EBI_DATA_BUS_D3        PIO_PB12_IDX
#define PIN_EBI_DATA_BUS_D4        PIO_PB13_IDX
#define PIN_EBI_DATA_BUS_D5        PIO_PB14_IDX
#define PIN_EBI_DATA_BUS_D6        PIO_PB15_IDX
#define PIN_EBI_DATA_BUS_D7        PIO_PB16_IDX
#define PIN_EBI_DATA_BUS_D8        PIO_PB25_IDX
#define PIN_EBI_DATA_BUS_D9        PIO_PB26_IDX
#define PIN_EBI_DATA_BUS_D10      PIO_PB27_IDX
#define PIN_EBI_DATA_BUS_D11      PIO_PB28_IDX
#define PIN_EBI_DATA_BUS_D12      PIO_PB29_IDX
#define PIN_EBI_DATA_BUS_D13      PIO_PB30_IDX
#define PIN_EBI_DATA_BUS_D14      PIO_PB31_IDX
#define PIN_EBI_DATA_BUS_FLAG1   PIO_PERIPH_A | PIO_PULLUP
#define PIN_EBI_DATA_BUS_D15      PIO_PB6_IDX
#define PIN_EBI_DATA_BUS_FLAG2  PIO_PERIPH_B | PIO_PULLUP
/** EBI NRD pin */
#define PIN_EBI_NRD                 PIO_PB19_IDX
#define PIN_EBI_NRD_FLAGS       PIO_PERIPH_A | PIO_PULLUP
#define PIN_EBI_NRD_MASK  1 << 19
#define PIN_EBI_NRD_PIO  PIOB
#define PIN_EBI_NRD_ID  ID_PIOB
#define PIN_EBI_NRD_TYPE PIO_PERIPH_A
#define PIN_EBI_NRD_ATTR PIO_PULLUP
/** EBI NWE pin */
#define PIN_EBI_NWE                  PIO_PB23_IDX
#define PIN_EBI_NWE_FLAGS       PIO_PERIPH_A | PIO_PULLUP
#define PIN_EBI_NWE_MASK  1 << 23
#define PIN_EBI_NWE_PIO  PIOB
#define PIN_EBI_NWE_ID  ID_PIOB
#define PIN_EBI_NWE_TYPE PIO_PERIPH_A
#define PIN_EBI_NWE_ATTR PIO_PULLUP
/** EBI NCS0 pin */
#define PIN_EBI_NCS0                PIO_PB20_IDX
#define PIN_EBI_NCS0_FLAGS     PIO_PERIPH_A | PIO_PULLUP
#define PIN_EBI_NCS0_MASK  1 << 20
#define PIN_EBI_NCS0_PIO  PIOB
#define PIN_EBI_NCS0_ID  ID_PIOB
#define PIN_EBI_NCS0_TYPE PIO_PERIPH_A
#define PIN_EBI_NCS0_ATTR PIO_PULLUP
/** EBI address bus pins  */
#define PIN_EBI_ADDR_BUS_A0 PIO_PB7_IDX
#define PIN_EBI_ADDR_BUS_NBS0 PIO_PB7_IDX
#define PIN_EBI_ADDR_BUS_A1     PIO_PB8_IDX
#define PIN_EBI_ADDR_BUS_FLAG1  PIO_PERIPH_B | PIO_PULLUP
#define PIN_EBI_ADDR_BUS_NBS1 PIO_PC15_IDX
#define PIN_EBI_ADDR_BUS_A2     PIO_PC0_IDX
#define PIN_EBI_ADDR_BUS_A3     PIO_PC1_IDX
#define PIN_EBI_ADDR_BUS_A4     PIO_PC2_IDX
#define PIN_EBI_ADDR_BUS_A5     PIO_PC3_IDX
#define PIN_EBI_ADDR_BUS_A6     PIO_PC4_IDX
#define PIN_EBI_ADDR_BUS_A7     PIO_PC5_IDX
#define PIN_EBI_ADDR_BUS_A8     PIO_PC6_IDX
#define PIN_EBI_ADDR_BUS_A9     PIO_PC7_IDX
#define PIN_EBI_ADDR_BUS_A10   PIO_PC8_IDX
#define PIN_EBI_ADDR_BUS_A11   PIO_PC9_IDX
#define PIN_EBI_ADDR_BUS_A12   PIO_PC10_IDX
#define PIN_EBI_ADDR_BUS_A13   PIO_PC11_IDX
#define PIN_EBI_ADDR_BUS_A14   PIO_PC20_IDX
#define PIN_EBI_ADDR_BUS_A15   PIO_PC21_IDX
#define PIN_EBI_ADDR_BUS_A16   PIO_PC22_IDX
#define PIN_EBI_ADDR_BUS_A17   PIO_PC23_IDX
#define PIN_EBI_ADDR_BUS_A18   PIO_PC24_IDX
#define PIN_EBI_ADDR_BUS_A19   PIO_PC25_IDX
#define PIN_EBI_ADDR_BUS_A20   PIO_PC26_IDX
#define PIN_EBI_ADDR_BUS_FLAG2  PIO_PERIPH_A | PIO_PULLUP
/** EBI pin for LCD CS */
#define PIN_EBI_NCS2                 PIO_PC16_IDX
#define PIN_EBI_NCS2_FLAGS      PIO_PERIPH_A | PIO_PULLUP
#define PIN_EBI_NCS2_MASK  1 << 16
#define PIN_EBI_NCS2_PIO  PIOC
#define PIN_EBI_NCS2_ID  ID_PIOC
#define PIN_EBI_NCS2_TYPE PIO_PERIPH_A
#define PIN_EBI_NCS2_ATTR PIO_PULLUP
/** EBI pin for LCD RS */
#define PIN_EBI_LCD_RS                PIO_PB8_IDX
#define PIN_EBI_LCD_RS_FLAGS     PIO_PERIPH_B | PIO_PULLUP
#define PIN_EBI_LCD_RS_MASK  1 << 8
#define PIN_EBI_LCD_RS_PIO  PIOB
#define PIN_EBI_LCD_RS_ID  ID_PIOB
#define PIN_EBI_LCD_RS_TYPE PIO_PERIPH_B
#define PIN_EBI_LCD_RS_ATTR PIO_PULLUP

/** Backlight pin definition. */
#define BOARD_AAT31XX_SET_GPIO        PIO_PC19_IDX
#define BOARD_AAT31XX_SET_FLAGS       PIO_OUTPUT_0 | PIO_DEFAULT

/** Define HX8347A base address. */
#define BOARD_HX8347A_ADDR            0x62000000
/** Define HX8347A register select signal. */
#define BOARD_HX8347A_RS              (1 << 1)

