remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam/boards/sam3u_ek/sam3u_ek.h
/** Define MCP980X TWI instance. */
#define BOARD_MCP980X_TWI_INSTANCE  (TWI0)
/** Define MCP980X base address. */
#define BOARD_MCP980X_ADDR          (0x48u)

//! LED #0 pin definition (BLUE).
#define LED_0_NAME    "green LED D2"
#define LED0_GPIO     (PIO_PB0_IDX)
#define LED0_FLAGS    (PIO_TYPE_PIO_OUTPUT_1 | PIO_DEFAULT)
#define LED0_ACTIVE_LEVEL 0

#define PIN_LED_0   {1 << 0, PIOB, ID_PIOB, PIO_OUTPUT_0, PIO_DEFAULT}
#define PIN_LED_0_MASK 1 << 0
#define PIN_LED_0_PIO PIOB
#define PIN_LED_0_ID ID_PIOB
#define PIN_LED_0_TYPE PIO_OUTPUT_0
#define PIN_LED_0_ATTR PIO_DEFAULT

//! LED #1 pin definition (GREEN)
#define LED_1_NAME    "green LED D3"
#define LED1_GPIO     (PIO_PB1_IDX)
#define LED1_FLAGS    (PIO_TYPE_PIO_OUTPUT_1 | PIO_DEFAULT)
#define LED1_ACTIVE_LEVEL 0

#define PIN_LED_1   {1 << 1, PIOB, ID_PIOB, PIO_OUTPUT_1, PIO_DEFAULT}
#define PIN_LED_1_MASK 1 << 1
#define PIN_LED_1_PIO PIOB
#define PIN_LED_1_ID ID_PIOB
#define PIN_LED_1_TYPE PIO_OUTPUT_1
#define PIN_LED_1_ATTR PIO_DEFAULT

//! LED #2 pin definition (RED).
#define LED2_GPIO       (PIO_PB2_IDX)
#define LED2_GPIO_FLAGS (PIO_TYPE_PIO_OUTPUT_1 | PIO_DEFAULT)
#define LED2_ACTIVE_LEVEL 1

#define PIN_LED_2   {1 << 2, PIOB, ID_PIOB, PIO_OUTPUT_1, PIO_DEFAULT}
#define PIN_LED_2_MASK 1 << 2
#define PIN_LED_2_PIO PIOB
#define PIN_LED_2_ID ID_PIOB
#define PIN_LED_2_TYPE PIO_OUTPUT_1
#define PIN_LED_2_ATTR PIO_DEFAULT

#define BOARD_NUM_OF_LED 3

//!// HSMCI pins definition.
/*! Number of slot connected on HSMCI interface */
#define SD_MMC_HSMCI_MEM_CNT          1
#define SD_MMC_HSMCI_SLOT_0_SIZE      8
#define PINS_HSMCI  {0x1f8, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_PULLUP}, \
		{1 << 3, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT}

/** MCI MCCDA pin definition. */
#define PIN_HSMCI_MCCDA_GPIO       (PIO_PA4_IDX)
#define PIN_HSMCI_MCCDA_FLAGS      (PIO_PERIPH_A | PIO_DEFAULT)
/** MCI MCCK pin definition. */
#define PIN_HSMCI_MCCK_GPIO        (PIO_PA3_IDX)
#define PIN_HSMCI_MCCK_FLAGS       (PIO_PERIPH_A | PIO_DEFAULT)
/** MCI MCDA0 pin definition. */
#define PIN_HSMCI_MCDA0_GPIO       (PIO_PA5_IDX)
#define PIN_HSMCI_MCDA0_FLAGS      (PIO_PERIPH_A | PIO_DEFAULT)
/** MCI MCDA1 pin definition. */
#define PIN_HSMCI_MCDA1_GPIO       (PIO_PA6_IDX)
#define PIN_HSMCI_MCDA1_FLAGS      (PIO_PERIPH_A | PIO_DEFAULT)
/** MCI MCDA2 pin definition. */
#define PIN_HSMCI_MCDA2_GPIO       (PIO_PA7_IDX)
#define PIN_HSMCI_MCDA2_FLAGS      (PIO_PERIPH_A | PIO_DEFAULT)
/** MCI MCDA3 pin definition. */
#define PIN_HSMCI_MCDA3_GPIO       (PIO_PA8_IDX)
#define PIN_HSMCI_MCDA3_FLAGS      (PIO_PERIPH_A | PIO_DEFAULT)
/** MCI MCDA4 pin definition. */
#define PIN_HSMCI_MCDA4_GPIO       (PIO_PC28_IDX)
#define PIN_HSMCI_MCDA4_FLAGS      (PIO_PERIPH_B | PIO_DEFAULT)
/** MCI MCDA5 pin definition. */
#define PIN_HSMCI_MCDA5_GPIO       (PIO_PC29_IDX)
#define PIN_HSMCI_MCDA5_FLAGS      (PIO_PERIPH_B | PIO_DEFAULT)
/** MCI MCDA6 pin definition. */
#define PIN_HSMCI_MCDA6_GPIO       (PIO_PC30_IDX)
#define PIN_HSMCI_MCDA6_FLAGS      (PIO_PERIPH_B | PIO_DEFAULT)
/** MCI MCDA7 pin definition. */
#define PIN_HSMCI_MCDA7_GPIO       (PIO_PC31_IDX)
#define PIN_HSMCI_MCDA7_FLAGS      (PIO_PERIPH_B | PIO_DEFAULT)

//! SD/MMC card detect pin definition.
#define PIN_HSMCI_CD {PIO_PA25, PIOA, ID_PIOA, PIO_INPUT, PIO_PULLUP}
#define SD_MMC_0_CD_GPIO            (PIO_PA25_IDX)
#define SD_MMC_0_CD_PIO_ID          ID_PIOA
#define SD_MMC_0_CD_FLAGS           (PIO_INPUT | PIO_PULLUP)
#define SD_MMC_0_CD_DETECT_VALUE    0

//! Push button #0 definition.
#define PIN_PUSHBUTTON_1    {1 << 18, PIOA, ID_PIOA, PIO_INPUT, PIO_DEGLITCH | PIO_PULLUP}
//! Push button #1 definition.
#define PIN_PUSHBUTTON_2    {1 << 19, PIOA, ID_PIOA, PIO_INPUT, PIO_DEGLITCH | PIO_PULLUP}

//! Push button #0 definition.
#define PUSHBUTTON_1_NAME    "USR-LEFT"
#define GPIO_PUSH_BUTTON_1    (PIO_PA18_IDX)
#define GPIO_PUSH_BUTTON_1_FLAGS    (PIO_INPUT | PIO_PULLUP | PIO_DEGLITCH | PIO_IT_RISE_EDGE)

#define PIN_PUSHBUTTON_1    {1 << 18, PIOA, ID_PIOA, PIO_INPUT, PIO_DEGLITCH | PIO_PULLUP}
#define PIN_PUSHBUTTON_1_MASK 1 << 18
#define PIN_PUSHBUTTON_1_PIO PIOA
#define PIN_PUSHBUTTON_1_ID ID_PIOA
#define PIN_PUSHBUTTON_1_TYPE PIO_INPUT
#define PIN_PUSHBUTTON_1_ATTR PIO_DEGLITCH | PIO_PULLUP | PIO_IT_RISE_EDGE

//! Push button #1 definition.
#define PUSHBUTTON_2_NAME    "USR-RIGHT"
#define GPIO_PUSH_BUTTON_2    (PIO_PA19_IDX)
#define GPIO_PUSH_BUTTON_2_FLAGS    (PIO_INPUT | PIO_PULLUP | PIO_DEGLITCH | PIO_IT_FALL_EDGE)

#define PIN_PUSHBUTTON_2    {1 << 19, PIOA, ID_PIOA, PIO_INPUT, PIO_DEGLITCH | PIO_PULLUP}
#define PIN_PUSHBUTTON_2_MASK 1 << 19
#define PIN_PUSHBUTTON_2_PIO PIOA
#define PIN_PUSHBUTTON_2_ID ID_PIOA
#define PIN_PUSHBUTTON_2_TYPE PIO_INPUT
#define PIN_PUSHBUTTON_2_ATTR PIO_DEGLITCH | PIO_PULLUP | PIO_IT_FALL_EDGE
//! List of all push button definitions.
#define PINS_PUSHBUTTONS    PIN_PUSHBUTTON_1, PIN_PUSHBUTTON_2

//! Simulated joystick LEFT index.
#define JOYSTICK_LEFT    0
//! Simulated joystick RIGHT index.
#define JOYSTICK_RIGHT   1

#define PIN_TC0_TIOA0       (PIO_PA1_IDX)
#define PIN_TC0_TIOA0_MUX   (IOPORT_MODE_MUX_A)
#define PIN_TC0_TIOA0_FLAGS (PIO_PERIPH_A | PIO_DEFAULT)

#define PIN_TC0_TIOA1       (PIO_PB5_IDX)
#define PIN_TC0_TIOA1_MUX   (IOPORT_MODE_MUX_A)
#define PIN_TC0_TIOA1_FLAGS (PIO_PERIPH_A | PIO_DEFAULT)

#define PIN_TC0_TIOA1_PIO   PIOB
#define PIN_TC0_TIOA1_MASK  PIO_PB5
#define PIN_TC0_TIOA1_ID    ID_PIOB
#define PIN_TC0_TIOA1_TYPE  PIO_PERIPH_A
#define PIN_TC0_TIOA1_ATTR  PIO_DEFAULT

#define PIN_TC0_TIOA2       (PIO_PA30_IDX)
#define PIN_TC0_TIOA2_MUX   (IOPORT_MODE_MUX_B)
#define PIN_TC0_TIOA2_FLAGS (PIO_INPUT | PIO_DEFAULT)

#define PIN_TC0_TIOA2_PIO   PIOA
#define PIN_TC0_TIOA2_MASK  PIO_PA30
#define PIN_TC0_TIOA2_ID    ID_PIOA
#define PIN_TC0_TIOA2_TYPE  PIO_INPUT
#define PIN_TC0_TIOA2_ATTR  PIO_DEFAULT

//! PWMC PWM0 pin definition.
#define PIN_PWMC_PWMH0  {1 << 0, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT}
#define PIN_PWMC_PWMH0_TRIG   PIO_PB0_IDX
#define PIN_PWMC_PWMH0_TRIG_FLAG   PIO_PERIPH_A | PIO_DEFAULT
#define PIN_PWMC_PWML0  {1 << 7, PIOA, ID_PIOA, PIO_PERIPH_B, PIO_DEFAULT}
//! PWMC PWM1 pin definition.
#define PIN_PWMC_PWMH1  {1 << 1, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT}
#define PIN_PWMC_PWML1  {1 << 8, PIOA, ID_PIOA, PIO_PERIPH_B, PIO_DEFAULT}
//! PWMC PWM2 pin definition.
#define PIN_PWMC_PWMH2  {1 << 2, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT}
#define PIN_PWMC_PWML2  {1 << 9, PIOA, ID_PIOA, PIO_PERIPH_B, PIO_DEFAULT}
//! PWM pin definition for LED0
#define PIN_PWM_LED0 PIN_PWMC_PWMH0
//! PWM pin definition for LED1
#define PIN_PWM_LED1 PIN_PWMC_PWMH1
//! PWM pin definition for LED2
#define PIN_PWM_LED2 PIN_PWMC_PWMH2

//! PWM LED0 pin definitions.
#define PIN_PWM_LED0_GPIO    PIO_PB0_IDX
#define PIN_PWM_LED0_FLAGS   (PIO_PERIPH_A | PIO_DEFAULT)
#define PIN_PWM_LED0_CHANNEL PWM_CHANNEL_0

